["\"'Cause I'm a wandering man, \" he said to me.","\"I may not be wise","\"There's nowhere else I'd rather be\"","\"there she goes, that crazy girl","'Cause I can't see","'Cause I can't see (it was a perfect illusion)","'Cause I left everyone I love at home","'Cause I lost my only friend","'Cause I lost part of me when I lost all of you, now I'm lost","'Cause I wanna be there","'Cause I'm not like that.","'Cause I'm tap, tap, tapping on the glass","'Cause I've learned to slam on the brake","'Cause everybody needs a friend, it's true","'Cause if I just believe","'Cause if change is what you need","'Cause it's a fired up world","'Cause it's a hard life","'Cause it's you and me","'Cause mom was all that she had to be","'Cause now I'm feeling so brand","'Cause soon I'm breaking out of here","'Cause that's where we make love","'Cause the sun burns bright","'Cause the sun shines bright for forever","'Cause then I don't have to look at it","'Cause this dance is on you","'Cause what if everyone saw?","'Cause when he's lookin' she falls apart","'Cause you been burned, you been burned, you've been burned","'Cause you can't buy a house in heaven","'Cause you know I know you best (I know you best)","'Cause you know me better, better than I know myself ","'Cause you think you won't find it tied to someone else","'Cause you’re out of this world","'Member when dad hung it there?","'There's somethin', somethin' about this place","'cause everyone needs a way to breathe","'cause life is never really what it seems","'cause maybe you could","'cause yeah, this room is crowded","(Come onto mama, come on, mama)","(Hey, man, get to work, catch up)","(My heart just speaks to me)","(Nothing) Nothing on but the radio,","(Tell 'em, girls)","10 steps and lonely nights","10 steps and roses on the tree","A Brooklyn Night affair.","A Texas girl real strong","A cruel king made me tough","A hybrid can withstand these things","A mountain of his soul","A shame shame","A time and place where we can never be again","A voice beats through the noise like drums ","About behaving, but I love you","About relaxing, hey, I love you","Above this little town, you do","Again and again","Again fooled me again","Again honest honest","Again oh when","Again oh when you fooled me again","Again oh when you fooled me again Oh baby yeah","Again, again, a-a-again, again","Again, again, again, again","Again, fooled me again","Alive with all the lips we've kissed,","All I ever do is run","All of that time is easy to swallow","All the Pinot, Pinot Grigio girls","All the broken hearts","All the things that are on my mind","All these little landmines","All these little things that one can read two ways","All we care about is, pornographic girlson film","All we care about is, runway models, cadillacs","All we see is light","All we see is light for forever","All we see is sky for forever","America, America, I love you","America, I love you","America, I would rather die without you and I, I, I","An open field that's framed with trees","And I am an honest man ","And I can feel my sanity start to unwind","And I can tell you see me too","And I can't have you, it isn't fair","And I don't wanna be alone forever","And I enjoy the gifts and trips to the islands","And I feel so down","And I got a reason that you're who should take me home tonight (Tonight)","And I know that it's complicated","And I say, \"Me too\"","And I see him come to get me","And I suddenly feel the branch give way","And I wanna be with you 'til I'm dead now","And I will be strong, I won't give in","And I won't run away","And I won't save the day","And I won't, I won't try to change you","And I won't, I won't try to tame you","And I'd enjoy some fine champagne while my girls toast","And I'll never love again","And I'll never love again,","And I'll still love you even if I can't","And I'll undress you","And I'm a hard girl","And I'm captivated","And I'm tuned into your station tonight,","And I've got nothing on but the radio.","And I've got nothing on for tonight.","And a lonely heart","And after all","And after all the boys and the girls that we've been through","And after all the drinks and bars that we've been to","And after all, it's just another day","And all the lies","And baby, you're just movin' on","And choreograph hours with playful, joyous thoughts","And cracked open our last beer,","And create simple thoughts, I'll laugh in humble ways","And don't stop the party","And everything's okay","And grow as we go, oh","And grow as we go, ooh","And if I had one wish","And if I'm coming on too strong","And if I'm disappointed","And in the silence of the night","And is your punch line just a joke?","And it's hard today","And it's right there, right there, right there","And it's so easy to forget","And know I'll always stay","And losing all control.","And love and dream and you can't stop me","And my lashes are falling","And my voice gets thin","And needs it... a little bit... too","And no one gets to look at it","And no one tells you where you went wrong","And pick up unique style, I'll kick around today","And she can't get enough","And she was so alive","And she's got rainbow syrup in her heart that she bleeds","And smile at all the new strange I meet","And so many little monsters, yeah","And sometimes, you see everything you wish you had","And the fighters of our time.","And the winds, well they keep on changing","And then he asked me,","And then we'll have our sixth","And then we're there","And there he goes","And they know, what they must do.","And they want independence.","And think of different ways to keep my spirits up","And this dance is on you","And this is what he said","And this is what she said","And took the road to nowhere on my own","And two last regrets","And we can waste the whole next day to recover","And we talk and take in the view","And we want independence.","And we would watch Rocky IV,","And we'll take it slow","And what about our future plans?","And when there’s nowhere to go","And when you say that thing that you say","And will I get to, get to know myself in the place I am","And you can too, you can too, you can too","And you can't stop me","And you cut through all the noise","And you know how good I can be.","And you know that you.","And you only got your daddy to call","And you think maybe everybody wants it","And you want to believe it's true","And you won't use my mind but","And you'll be my little gypsy princess","And your cigarette stained lies","And your friends are gone","Are flown on beaches for public sight","As fitting as McQueen.","As long as I'm here as I am, so are you","Baby","Baby don't cry","Baby loves to dance in the dark","Baby loves to dance, loves to dance in the dark","Baby make it to me","Baby when you tear me to pieces","Baby would you be there","Baby you gave up, you gave up","Baby you must be free","Baby you must believe","Baby you’ve gotta friend","Baby, I'm a free bitch","Baby, for life","Bad habit, I know","Bang, bang.","Be a slave to the blonde or the culture of the popular","Be brave for you you'll see","Be sure that I'll say go","Be your best friend","Because you've learned, because you've learned","Been a long time but I'm back in town","Been hurting low from living high for so long","Been one of those days","Before I even turn the key","Before I lead with the worst of me","Before I make the mistake","Before the end of this song","Behind the aura, behind the aura, behind the aura?","Better get a good look baby","Bike the Appalachian trail or","Born march of '86, my birthday's coming","Both of us are gonna make mistakes 'cause","Boy, I used to throw a party over every little thing you'd do","Boy, and then I can make you smile","Boy, we're almost there","Boy, you were getting ready to leave","Brooklyn Nights happy.","Buckets of rainwater","Buddy, you and I for forever this way, this way","Burned all your letters just for fun","Bust the rearview and fire up the jets","But I am so alone in it, help me please","But I believe that when it's done","But I can be tonight","But I can be tonight, tonight","But I can be tonight, tonight.\"","But I can't get you out of my head now","But I can't help myself","But I can't pretend to love you no more, babe","But I catch myself falling, falling","But I do","But I do ","But I do, but I do, but I do","But I don't need these 14-carat guns to win","But I dont want this last cigarette to be over","But I feel you watchin' me","But I feel you watchin' me (illusion)","But I feel you watchin' me (mistaken for love)","But I guess my photo album's none of your concern","But I guess, I could forgive you, tonight.","But I haven't helped you to hear it","But I hope now you can see","But I just close my eyes and dream","But I know you too well to get it wrong","But I love gypsy life","But I must admit, that, I'm everything you're not.","But I think with you I can spend my life","But I want no one else (I want no one else)","But I will, I will if I want to","But I will, I will if you want to","But I won't be tonight","But I won't cry anymore","But I'd like the company through every twist and turn","But I'd never lead you astray","But I'm a loser in love","But I'm a safe place to land","But I'm gonna make it happen this time","But I'm needin' you right now","But I'm so down today","But I’m living on, living on the the radio","But at least now I know","But baby, my search is done.","But baby, you can not forget the past","But every sun doesn't rise","But in the bedroom the size of him's more than enough","But it will be all right honey","But it's me that I miss now, there's a me that I didn't keep","But it's not what makes me happiest baby","But it's true, oh","But look at me and tell me you don't see, oh","But look in my eyes","But she still does her dance","But she still kills the dance","But the poets,","But then I trip over myself and I fall","But then you print some shit","But this could last","But today I won't be so hard on me","But we were happy","But when I walk down the street I hear them say","But when it comes to clothing, I'm bad.","But when it comes to you and me,","But when you collect me with your steady hand","But you choose \"death and company\"","But you never used to bring somebody else along","But your eyes go so well with the day","But your power can strip me away","But you’ve still got me","But, baby, he's already caught them","By the way that you say my name","C'mon baby, do you have a girlfriend?","Call out loud for you","Can I lean on you?","Can anybody see, is anybody waving back at me?","Can anybody see, is anybody waving?","Can not forget the past","Can profit you","Can rescue you","Can you help me out?","Can't sleep with the man who dims my shine","Can't wait to see you soar","Cant begin to say","Caught up in your show","Cause I really tried, and I","Cause I see every part of you","Cause I've got nothing on, but the radio","Cause for a while, you could barely look at me","Cause the ceiling fell in and the bottom fell out","Cause when you put your trust in me","Come alive","Come on and run","Come on mama","Come on meet me","Come on, Mark","Come to mama","Come to mama (Come onto me)","Come to me","Coming here when I'm still with him","Coming to say \"Hello!\"","Concrete poetry to feed my mind,","Confess to me where you have been","Confused & ludicrous.","Consumed, by all the pleasures, that are mixed.","Corks off, it's on","Could I give it all up for you?","Could we fix you if you broke?","Could you give it all up?","Couldn't hurt you if I wanted to","Cuz we gotta taste for champagne and endless","Cuz we wanna live the life of the rich and","Daddy's girl's never good enough","Damn I love the Jag, the jet and the mansion","Damn I'd love a boat by the beach on the west coast","Dancin' in circles, feels good to be lonely","Dancing in my revelation,","Darlin' only you can ease my mind","Darlin' only you can ease my mind ","Darlin', only you can ease my mind","Darling, you might think it's too soon","Diamond heart ","Diana, you're still in our hearts","Did I even make a sound?","Did you keep my sweater, sweater","Did you read my letter, letter?","Dilated, falling free","Display your diamonds and pearls in mine","Do what you want with my body","Do you ever really crash, or even make a sound?","Do you know me better, better than I know myself?","Do you let signs tell you what to do?","Do you remember where we stayed?","Do you wanna peek underneath the cover?","Do you wanna see me naked, lover?","Do you wanna see the girl who lives behind the aura","Do you wanna see the girl who lives behind the aura, behind the aura?","Do you wanna touch me, cosmic lover?","Does this thing we have even make sense?","Doin it for the fame","Doin' it for the","Don't ask me how or why","Don't be afraid, tonight's the night","Don't forget me when I come crying to heaven's door","Don't give up baby","Don't have the heart to play with yours","Don't humor me with kindness","Don't know why you wanna blow it","Don't leave me, I","Don't let your wonder turn into closure","Don't shoot.","Don’t be such a holy fool","Down the streets that I love","Drink is my last one","Drive the winding country road","Dude in a lab coat and a man of God","Dye Ashley's hair red","Each day, I cry","Electric Kiss.","Electric Kiss. ","End of May or early June","Enigma popstar is fun, she wear burqa for fashion","Even though, I'm red, you are blue.","Every part","Everybody's got to love each other","Everyone tells him he should work a little harder","Everything moves away","Everything you mean to me","Except sometimes, you see everything you wanted","Except us two","Eyes ","Faces of strangers and I have no familiars to help me see","Falling asleep in our tears,","Fame","Fame ","Fame fame baby","Fame is our felony,","Fame!","Fashion!","Feels like we could go on for forever this way","Feels like we could go on for forever this way, this way","Felt my feet stop short and I turned my head","Find your Jesus","Find your Kubrick","Find your freedom in the music","Fire can't burn these hands","Flash, bam, alacazaaam,","Flash, bam, alacazam,","Flash, bam, alacazam, wonderful you came by.","Follow me","Follow that unicorn on the road to love","Fooled me again","For a hundred or two","For just one Brooklyn Night adieu","For just one Brooklyn Night adieu.","For someone just like you","Fought over prisms and a forty-day flood","From everyone I love and say goodbye","From far across the yellow field I hear him calling, \"Follow me\" There we go","From miles away","Full of dirty lies","Full of honest lies","Full of shhh","Funk me downtown","Galaxy, space and time","Gather 'round now","Get Ginger ready climb El Camino front","Get a spray tan on Holiday, in Taipei","Get here and I'll make it worth, your while","Get to fall in love with another man and understand","Get your hot rods ready to rumble 'cuz we're gonna drink until we die","Get your hot rods ready to rumble 'cuz we're gonna drink until we die ","Get your hot rods ready to rumble 'cuz we're gonna fall in love tonight","Girl","Girl's playin' bad 'cause it doesn't pay to be good","Give me something I wanna be, retro glamour,","Give me something, I wanna see television and","Give them no reason to stare","Go ahead and don't believe","Go turn out the light","God forgive my sins","Goin', girl?","Goin', girl? ","Going to a movie, then we wander home","Gonna make love to the stark","Good bye. ","Good thing I know what I'm worth","Got too much time on my hand","Got too much time on my hands.","Grab a scoop at À La Mode","Grow as we go, ooh","H-ooow?","Haaaa-oooo-wow?","Had gooonnne, bye.","Happy Thanksgiving","Happy in the club with a bottle of red wine","Harder night","Has me so taken and I","Hate to say that I love you","Hate to say that I miss you","Hate to say that I need you","Hate to say that I want you","Hate to say that I'm lonely","Hate to say that it's dark in here","Have I bit my tongue one too many times","Have I killed my thoughts right before their prime?","Have I said it all the way I really meant to?","Have a drink with your former self","He kneeled on both knees","He looks around and says to me","He never really saw me","He said, \"Baby, why do we love each other?\"","He said, \"Sit back down where you belong","He was funny strange and mild","He wrote her poems songs and prose","He's come to get me","He's gonna get you and after he's through","Head full of Jameson","Heartsick little lover boy who went and lost himself in you","Heaven's not","Help me leave these lonely thoughts behind","High like amphetamine","Hold me closer,","Holding on to love.","Hollywood yes we live for the","Honest eyes","Honest honest eyes","Honest honest honest eyes","Honestly, I know where you're goin'","Hope my ruby shoes get us there quick","How I feel for you, my love.","How beautiful our love could be","How did they get there, jerk?","How do you wanna groove?","How?","Hurts inside, but not this time","I always thought even though,","I always thought it was you,","I am a winner","I am a woman, I insist it's my life","I am all up inside your head.","I am unfinished, I've got so much left to learn","I am who I am","I am wind and hurricane","I can be the queen","I can make you some good","I can see myself in the movies with my","I can't believe how you looked at me","I can't believe how you slurred at me","I can't believe what you said to me","I can't deny this feeling inside, oh no!","I can't help myself I'm addicted to a life of","I can't promise it's not written in the stars","I can't recognize","I cannot control it lately","I cannot control it, baby","I climb 'til the entire","I climb higher and higher","I close my eyes","I come alive","I could try to stop calling, calling just to show myself","I cut lines, so, wait your turn.","I decided on you","I decided on you, I've decided on you","I didn't brush my hair","I do a trick","I don't feel like we're done here","I don't feel like you're supposed to when somebody sets you free","I don't have you to kiss now and I'm putting myself to sleep","I don't know how this river runs","I don't know if you're listening or if you wanted to hear from me","I don't know what to tell you know","I don't know who we'll become","I don't need eyes to see","I don't think you have to leave","I don't wanna be alone forever","I don't wanna come crawling, crawling","I don't wanna wait any longer for the feeling of getting stronger","I don't want 'em back, never give 'em back to me","I feel down, I wish you were mine","I feel good, I walk alone","I feel put back together inside","I feel the gravity between us","I felt you touchin' me","I follow your steps with my feet","I fool myself","I found an old pair of","I got a diamond heart","I got my headset.","I grew up in New York City,","I guess I couldn't give that up","I guess I couldn't let that go","I guess I thought I could be part of this","I guess I wanted to believe","I had a better plan,","I had a better plan.","I have a hero whenever I need one","I hear you screaming, is it because of pleasure or toil?","I just look up to you and I see one","I just wanna stare at your face","I just want you alone","I killed my former and","I know I fucked up again","I know I might sound like a creep","I know I've played with hearts before","I know that I'm gonna make mistakes but","I know that you are the one that is brave","I know that you'd stay","I know there is none","I know you're outside banging then I won't let you in","I know, I know it's too soon, too fast","I know, I know it, it feels like love","I know, we could be great for tonight.","I know, we're just friends, but","I lay around, touch myself to pass the time","I left my virtue and my favorite shoes","I like it rough","I like it rough I","I like to burn.","I look around","I lose myself inside your mouth","I love that lavender blonde","I love the way you lie, I do","I love you","I love you more and more each day","I love you more than you'll ever wrap your head around","I loved Brigitte Nielsen's hair.","I make sense of the madness","I may not walk on your street or shoot a gun on your soil","I might not be flawless, but you know","I miss our cheap chandalier","I need a man that thinks it's right when it's so wrong","I need something more from you","I need ya,","I need you to know that I heard you, every word","I never ever thought I'd live away","I never felt like this before, this before.","I never had that perfect girl","I never had the dad who stuck it out","I never had this kind of thing before","I never let them see the worst of me","I never meant to make it such a mess","I never thought that it would go this far","I never was the kind of girl,","I only need one to fill the emptiness and I","I only swear to do the best I can","I own the world, we own the world","I paid a price, worked and I wallowed","I promise this","I promised I","I said you'd make it","I said, \"Honey, it's simple.","I still feel the blow","I still need you","I think that I could be fine","I think we'd have a good time","I think, I love you.","I thought that baby you were done","I toss that cork and call","I touch myself and it's alright","I touch myself can't get enough","I tried crossing out your words","I try to speak, but nobody can hear","I walk on the road that you started","I wanna be there","I wanna be there for you","I wanna be your emergency contact","I wanna clean up your mess","I wanna dress you up in silk, Taffeta","I wanna know where you hide things","I wanna make it work.","I wanna pick up your clothes","I wanna see you there","I wanna share your address","I wanna watch you while you sleep","I want a key to your house","I want it all with you","I want one last night there,","I want your friends to be my friends","I was 23","I was humming a tune, drinking in sunshine,","I was insecure, insecure.","I was made for loving him.","I was spiraling out","I was walking along minding my business","I was walking along, minding my business,","I was walking down 57th street towards Park","I went into a spin and I started to shout","I will fly on a challenger across the sky","I wish you were here","I won't deny you, I know where we've been","I won't give it up","I won't give up on my life","I won't run away\"","I won't run away\" ","I wonder if this could be love","I would fall apart","I would rather die without you and I ","I'd call you my champion","I'd give anything again to be your baby doll","I'd recommend, a one-night stand.","I'll admit, for a moment I felt so afraid","I'll be busy being so brand new","I'll do what I can to make you see, oh","I'll hold my whiskey up high","I'll just keep go-go'n","I'll keep on searching for an answer 'cause I need you more than dope","I'll lay back in my chair and find a way","I'll lay your clothes over my chair","I'll make it burn.","I'll make you breakfast in your bed","I'll never love again","I'll never talk again","I'll never write a song","I'll turn away, I'll turn away, I'll turn away","I'll walk alone down a different street","I'm a free bitch","I'm a loser","I'm a lost, lonely one here who's addicted to holding on","I'm a man 'cause you taught me to be one","I'm a man without a home","I'm a safe place to land","I'm a sinner","I'm a soldier to my own emptiness","I'm a warrior queen","I'm an honest man","I'm ashamed that I'm proud of it, too","I'm calling cause I need you,","I'm calling just to tell you,","I'm captivated","I'm captivated by you","I'm everything that I am","I'm everything that I am because of you","I'm fashionably just designed to be rad.","I'm gonna be the one that he loves,","I'm gonna burn a hole in the road","I'm gonna change the world, with my lips.","I'm gonna lace up my boots","I'm gonna marry the dark","I'm gonna marry the night","I'm gonna run right to, to the edge with you","I'm in a battle, man.","I'm in the bedroom with tissues and when","I'm nobodys mother","I'm not a wandering slave, I am a woman of choice","I'm not flawless, but I got a diamond heart","I'm not going anywhere","I'm not gonna cry anymore","I'm not good at pretending that I'm happy to be alone","I'm not sure the best way to say this","I'm not what you planned","I'm old-school & you're so new.","I'm on the ground","I'm on the road, I'm on the road to love","I'm only nineteen.","I'm over the show","I'm physically crafted to be","I'm pretty sure it would kill me","I'm shiny and I know it","I'm singin'","I'm singin' dancin' in circles, feels good to be lonely","I'm so much more than all of my fears","I'm so unpredictable, just like you used to be","I'm so unpredictable, you don't know what to think","I'm sorry, and I love you","I'm starting to see, it's me that feels this way","I'm sure I'll forgive you, and soon","I'm sure it was nothing","I'm waving through a window","I'm waving through a window, oh","I've been hit, this is it, this is it.","I've decided on you","I've dreamed it's happening","I've learned to slam on the brake","I've never felt so brand new ","I've said all I can","I've turned the lights down low,","I've waited way too long to say","I've waited, and I'm captivated","I, I stand up, and then I'm okay","I, I've carried this song in my mind","If I could be Mary Jane Holland tonight","If I had it my way, I'd be kinder than you","If I promise boy to you","If I wait 'til my tomorrow comes","If I’m living on the radio","If only you would take a chance","If to change is what you need","If we don't figure this out","If you break my heart","If you come out then so will I","If you could","If you didn't know the pieces of me are pieces of you","If you ever let me go","If you find it, send it straight to Hollywood","If you have to end it, get it done","If you have to hurt me, hurt me once","If you keep getting burned","If you keep it going","If you love me at all, you'll kill it now","If you wanna steal my heart away","If you want me","If you'd meet me Mary Jane in Holland tonight","In Electric Chapel","In Hollywood on the weekend","In a modern ecstasy","In a modern ecstasy (mistaken for love)","In a perverse hue","In a world unknown","In all your glamour and cruelty","In between the moments of","In case you don't live forever, let me tell you now","In case you don't live forever, let me tell you the truth","In every mystery, there's a truth","In front of you","In it for the fame fame baby","In my fishnet gloves","In peace, love, solitude, & happiness.","In the corner of my bar with your high heels on","In the dark","In the dark ","In the fire I call your name out (call your name out, call your name out)","In this crazy love we're leading","In your tight jeans with your long hair","Is anybody waving?","Is it 'cause you don't mean it","Is it because you don't mean it","Is the waiting all I've ever done?","Isn't it a shame shame baby","It doesn't matter where I go","It feels like flying","It was a perfect illusion","It was a perfect illusion (perfect illusion)","It was a perfect illusion, illusion, illusion","It wasn't love, it wasn't love","It wasn't real, I know","It will be all right, honey","It's 'cause I've waited far too long","It's 'cause you're not the person I knew","It's a little too rough","It's always harder these second time around","It's always harder this second time around","It's been a long time since I came around","It's been so long but now,","It's easier for us to hide","It's funny how things, they change","It's good to live expensive you know it but","It's hard to feel the rush, to brush the dangerous","It's just another day ","It's like I never made a sound","It's like he knew my thoughts and he read my mind","It's me that feels this way","It's my daddy and America, and Jesus Christ","It's not a statement as much as just a move of passion","It's some kind of joke, I'm obsessively","It's the way that you love and treat your mother.\"","Its been a hard day","Its been two days","Its good to live expensive you know it but","Its just that I can't watch us bleed to death","Its not that I don't wanna love you","Its not that I don't want to love you","Its not that I'm really over it, you know (you know)","It’s not about sex or champagne","I’m my own queen","I’ve got no friends","Judy","Just a little inside","Just another way to prove I love you","Just ask your gay friends their advice, before you","Just do that thing that you do","Just dont want this last","Just for tonight.","Just give in","Just know when","Just to keep them talking","Just to show you the mess that I made","Just wanna hang with the old you","Keep it real cold","Keep it tight","Keep living on, living on the radio","Keys in my purse that opened","Kiss the bartender twice","Ladies and gentlemen, Brian Newman","Last night we were alone","Last time, I thought we had this talk","Last time, we were hanging out","Last week when I was sad","Leaning on somebody isn't easy","Leaning on somebody's never easy","Leave nothin' on these streets to explore","Leave nothing on these streets to explore","Left her in the trunk on highway 10","Let's funk downtown","Like Dorothy on a yellow brick","Like a phoenix so you can remind them of the dream I bore","Like buddies do","Like girls we wish would notice us but never do","Like it's a catwalk","Like no one else","Like we'll be alright for forever this way","Like when you take every call outside","Likes it rough, likes it rough","Listen, it's echoing in me","Live passionately tonight","Long rides, baby by the coast","Look at me smile with tears in my eyes","Look what that rainbow did ","Lookin' to be somethin'","Love is good until it's gone","Love is the new denim or black","Love the way you can make me dance","Lovers' kites","Loving me is like chewing on pearls","Loving me is like straightening curls","M-m-m-marry m-m-m-marry m-m-m-marry the night","Make 'em sing to me instead, it's you","Make me laugh for just a little while","Make me sweeter,","Making plans I'm gonna do when I get older","Man, it wasn't that long ago we were all living in the jungle","Marilyn","Married to the night","Maybe that's why I wrote a song for you","Maybe the second time around is not meant for us, baby","Maybe then we'd both tell the truth","Maybe we can see the world together","Maybe you're just a dream","Meet me at Electric Chapel","Meet me, meet me baby in a safe place","Might not awake without you","Mine myself like coal","Mistaken for love, it wasn't love","Most days I wake up with a pit in my chest","Most nights I am restless, and quiet won't come","Moved downtown when I was just nineteen,","My arm goes numb","My blood is pure","My body is sanctuary","My darkest sin","My eyes change from kinda green","My guessing game is strong","My heart can beat with bricks and strings","My heart is on mute.","My heart would break without you","My knees get weak, intensive","My teenage dream tonight","My veil is protection for the gorgeousness of my face","Need a man who likes it rough","Needs you more","Never burn out this candle baby, baby","Never felt so brand new","Never going back, never going back to that","Never let you fall apart","Never stop","Never stop again and again","Never stop, oh","New York is not just a tan that you'll never lose","New, new, new (so brand new)","Next to the bar","No I can't for just as long as I met you.","No corny jokes or baseball gloves","No longer reason to pry or to justify,","No matter lightning or thunder,","No mom who just was there","No slipping up if you slip away","No you can't stop me","No, I got nothing to say","No, I just can't seem to forget you","No, I'd rather pretend I'm something better than","No, I've never felt so brand new","No, no one can really see","No, this is not a temporary love","Not meant for us, baby","Nothing can make sense of all these things I've done","Nothing's too cool","Now I'm the princess of a downtown train","Now it's the second time around","Now my heart is in your hands","Now that I'm better","Now that I'm wakin' up","Now that you're gone, I carry nothing","Now the girl is stressed","Now your heart is in my hands","O-or you know what I will do","Of all my wrecked up friends","Of my aching heart","Of our bad luck dating.","Of your voice in the morning","Off of seven years","Oh","Oh and he's no accessory to me.","Oh boy you've left me speechless","Oh boy, why you so speechless?","Oh darlin', only you can ease my mind","Oh friend you've left me speechless","Oh help me leave these lonely thoughts behind","Oh m-m-marry m-m-m-marry m-m-m-marry the night","Oh oh he loves me all up","Oh yea","Oh yeah","Oh, I","Oh, I could use some two or three","Oh, I feel so low from living high","Oh, I'd hate myself until I die","Oh, I'll never stop believing","Oh, I've never felt so brand new","Oh, I've never felt so brand new, new, new (so brand new)","Oh, You do something crazy to me","Oh, You do something for me baby","Oh, and somewhere in your room","Oh, can you hear me singin'?","Oh, come tomorrow","Oh, oh, does it all make sense?","Oh, oh, make it all make sense","Oh, oh-oh-oh-oh-oh","Oh, one voice, forever.","Oh, sugar,","Oh... oh... oh...","Oh... oh... oh... oh...","Ohhh,","Old symbolism was left behind.","On a perfect day ","On every street there is a memory,","On my bubble dreams, bubble dreams","On the Pinot, Pinot Grigio girls","On the outside, always looking in","On the road","One branch then to another","One foot after the other","One glance from your eyes,","One look and I yelled timber","One look and I'm done,","One night before they went to bed","One night he couldn't get to bed","One voice, forever.","One, five, ten, lay a million on me","Open up your heart and your mind to me","Or because I don't feel it","Or other kind of ways to be","Or waited when we were hooking up","Or would they hate it too?","Our hands on the headboard, it's our defense.","Our physical dreams, are only skin deep,","Out of school go-go'n","Out of the orange colored sky.","Out of the orange colored, purple striped, pretty green polka dot skyyy","Out on the weekend","Out on this lonely road, on the road to love","Pack your bags and we can chase the sunset","Part of me is a question, can't answer it on my own","Passed a gray-haired man and I found his eyes","Photograph my mind and whatever else you'd","Picked up her microphone","Picturing myself in your room","Please don't give it up","Pour your heart out","Pray for your sins","Pressure's takin' its toll","Pretend I'm something other than","Pretend that I am you until it clicks","Prom girl wipes her tears with silver lines","Promise that I'll meet you halfway","Psychic guru catches minnows in the harbor","Pull the shades down low","Put down their weapons, in their rhymes.","Put the knife under the hood.","Put your drink up for America","Quoting songs by our favorite bands","Racing toward the tallest tree","Rain on me a million","Ready for you","Ride, ride, pony, ride, ride","Ride, ride, pony, tonight","Right on the limits where we know we both belong tonight","Right under the glass disco ball","Road paved in gold","Run, run hide your cha-cha, baby she goes","Run, run with the fury of the saint in her eyes","Run, run with the top down baby, she flies","Run, run. Her kiss is a vampire grin","Russian hookers, and cheap gin","Said goodbye to family and friends","Saying life is gonna find you when it's supposed to","Searching for something to say","See me as I am","See the lonely girl","See you anymore","Seemed like a real perfect fit,","Seems that I've forgotten how to read your face","Seven years ago","She cant relate to joy, ohh","She dried her eyes","She knew that he'd propose","She looks good, but her boyfriend says she's a mess","She looks good, but her boyfriend says she's a tramp","She lost the fight","She loves to dance in the dark","She loves, she loves to dance in the dark","She only wondered when","She sang, its alright baby","She says, \"let your teardrops fall\"","She thinks she's something in this world\"","She tries to speak it","She was 35","She won't walk away, but she won't look back","She's a free soul burning roads with the flag in her bra","She's a mess","She's a tramp","She's a vamp","She's just an American riding a dream","Show me I can","Show me that I can","Silicon, saline, poison inject me","Since I was born on Broadway, baby!","Since he left home","Sing with me, \"Bell Bottom Blue\"","Singing to the tune","Sisters never pack up","Sit back down on the couch where we made love the first time and you said to me","Skeleton guns are wedding bells in the attic","So I got nothing to share","So I grin","So I just packed my baggage and","So I just stand here sorry","So I lay there and wait for the sun","So I said, \"I don't wanna be alone forever.","So I wait around for an answer to appear","So I'mma close my ears and dream","So baby raise a glass to mend","So brand new","So brand new, oh (so brand new)","So happy I could die","So hear me when I say","So how do I step in","So into bed she piled","So just take my body","So let's shack up","So put your drink up","So she kneeled on both knees","So speechless","So unemotional, boy I can't forget the way you were with me","So unemotional, wonder if I'm still in love","So we'll turn on a bachelorette","So when I start to bawl","So when I'm feeling small","So why do we gotta fight over ideas?","So why do we gotta put each other down","So why do we gotta tell each other how to live?","So you build your walls of today","So you... make it true","So, please, show me that smile,","Some asshole broke me in","Some drinks and then a rose","Some girls won't dance to the beat of the track","Some men may follow me","Some nights his dreams would drive him wild","Some superstars & masochists,","Some years went by they had a child","Someone to quiet the voices in my head","Somethin' 'bout New York nights and my lipstick on your face","Somethin', somethin' about my cool American guy","Something to say","Sometimes I think that we could just be friends","Sometimes I wonder if god hides out in cities to set us free","Sometimes I'm scared I suppose","Sometimes a story has no end","Sometimes the simplest move is right","Somewhere in all the confusion","Sonja was Joanne's friend","Spice girl in this bitch","Starry night come inside me like never before","Stars in our eyes 'cuz we're having a good time","Step into the room","Step into the sun ","Step into the sun?","Step out, step out of the sun","Still, baby.","Stone river eyes","Stop throwin' stones at your sisters and your brothers","Street lights glow red, green, and yellow too","Stuck in the middle zone","Sun don't wanna come out","Sun shines on my face","Swirl around as if I'm someone else","Sylvia","Tailor these clothes to fit your guilt, what's your size?","Take a breath and I picture us in a place","Take my hand and let it spin","Take my hand, stay Joanne","Tap down those boots while I beat around","Taught me this drunk song","Tell 'em how you feel girls!","Tell me who hurt ya","Tell me you don't wanna leave","Telling jokes no one understands","Than I know myself?","Than all of these tears, my tears yeah","Than the angels do","That I wish you were here","That I'd forget the thing that you said","That I'll never talk again","That glass is empty","That makes me mad","That makes me wanna scream","That the growing only happens on your own?","That the world is gonna bend","That was always our favorite place","That we grew up together","That we've barely even met","That's money honey","That's naturally sure when it comes to love, oh no!","That's not a worthy explanation","That's what it means to crush","That's what you learned, what you've learned, what you've learned","That’s my dream","That’s your dream","The boy fooled me again","The champagne and the sold out shows","The clouds they part, rearrange for me","The color palette you choose","The fame and riches earned","The fame fame","The fashion of his love.","The killer queen inside me's","The lady I've become","The melody that you choose","The moon lights her way while she's howlin' at him","The one where the Russian scored,","The only prisons that exist are ones we put each other in","The party's just begun","The queen that's inside of me","The queen you need me to be","The rockstars girlfriend","The stormy sky and rain","The sun is just like the sound","The taste of your skin,","The things we'll do when we get out of school","The walkup we shared","The warmth of your hungry lips","The way she moves","The way she walks","Their love for him ran deep","Them what I'm made of, oh!","Then I don't have to see what's really there","Then I'll go down to the bar","Then breathe me one breath,","Then grow to need me there","Then one by one, the memories will start to blur","Then plans to meet again","Then spend quality time with your mother","Then when you're older, you'll wish for time to turn around","There ain't no reason you and me should be alone","There are pieces I usually hide","There are thoughts that I can't put to rest","There's a trouble that won't show its face","There's a worry that I can't place","There's gonna be no future","There's gonna be no love left to rye","There's no way I could be stopped,","There's nothing I can say","There's nothing kind about a hundred small betrayals","There's nothing that we can't discuss","There's only three men that I'm 'a serve my whole life","There's somethin', somethin' about the chase six whole years","There's something about you in the moonlight","These broken parts","They all tell you that freedom must be bought","They don't care if your papers or your love is the law","They don't know me and you","They met at school that's how it goes","They say I need a strong man, not just a friend","They tell me if I leave him","They won’t tear me apart","They're gonna give the world some of this.","They're gonna start a resistance.","Things don't work that way","This Ferris wheels got me crazy","This could be love","This feels so good, it can't be wrong.","This is my chance to be the dance","This is my chance to release it","This is not a temporary love","This is not a temporary love ","This mess that I am","This picture-perfect afternoon we shared","This purse can hold my black card and tiara","This second time around","This second time around ","This time I'm not leaving without you","This time, I thought that we'd be fine","This was just a sad invention","Those Brooklyn Nights set us free.","Thought that I would be alone forever","Thought we had already won","Three spirits and","Through all the tears","Throw on some leather and cruise","To help him fall asleep","To love is not to leave","To start a new life on the New York scene.","To take me from you","To the stars in the land","Toast one last puff","Together we'll dance in the dark","Tonight I will return","Tonight I'm gonna show","Tonight, tonight, tonight.","Tonight, tonight.","Tough girls on the mend","Tried to lean into every word he said, then he said","True friends","Try to make it pay","Tryin to make it pay","Tryin' to keep control","Turn the car on and run","Twelve lonely steps","Two friends","Two friends on a perfect day","Uh oh","Underground pop civilization.","Unless it's rough","Up all night tryin' to rub the pain out","Up all night tryin' to rub the pain out (rub the pain out)","Up heaven's stairway to gold","Up in the clouds","Up in the end it'd be us,","Used to be our thing","Vanish as I touch myself","Versace promises I will, Dolce Vita","Wait 'til I get my hands on you.","Wait till I get my hands on you","Wait, I think it's time","Walk down the runway, but don't puke, It's okay","Walk into the light","Wam, bam, alacazam,","Wanna be in your photos","Wanna share your address","Want a good thing, put the money down first","Was coming for your spot.","Was taking my best shot,","Watch out for flying glass.","Watch your blues turn gold","Waving through a window","Waving through a window, oh","Way too real to be wrong","We always run back love","We always thought we were it,","We are a generation twisted, by a myth.","We both know","We both know I could learn a thing or two","We both won't act like someone else","We can be strong, we can be strong","We can over-drink at your favorite place","We could be alright for forever this way","We don't have to hide our love away and","We got a whole lot of money but we still pay rent","We just talk and take in the view","We let the world pass by for forever","We live for the fame fame baby","We pick a spot and shoot the breeze","We start believing that we belong","We start with stars in our eyes","We tried going back to Joes","We walk a while and talk about","We were so young we could grow.","We'd take the F or the bus,","We'll be higher than ever","We'll haunt like Liberace","We'll hold still","We'll live together.","We're both ready so lose control","We're gonna give the world some of this.","We're gonna see that it was better","We're gonna start a resistance.","We're so in love with it.","We're talkin' the same old shit after all of these years","We're two of a kind,","We, we've only got so much time","Well its alright baby","Well, I say rainbows did more than they've ever done","Wham, bam, alacazam, I got a look at you.","What did I do to deserve you?","What do you think is the new thing?","What do you wanna do?","What do you wanna wear this season?","What do you wanna wear this spring?","What if everyone knew?","What my mom and dad showed me","When I got the whole world in front of me","When I listen to your voice","When I was crying over you","When I'm with you I'm never jaded,","When I'm with you, I'm so sedated,","When I'm your lover and your mistress","When love came and hit me in the eye","When out of that orange colored view","When out of the orange colored sky,","When the world around is caving in","When there's more than enough love to g-g-go around?","When they pull me under","When we used to be","When you are younger, you'll wish you're older","When you get here, boy, we can dance.","When you get older, when you get older","When you get older, you'll wish for time to turn around","When you give me k-kisses","When you light my world up and I","When you run dry I'll flood your pain","When you touch me I die","When you touch me it's so delicious","When you're 'round","When you're around it","When you're cool,","When you're falling in a forest and there's nobody around","When you're high I'll take the lows","When you're not around","Whenever I start feeling strong, I'm called a bitch in the night","Where Brooklyn Nights set us free.","Where are you?","Where do you think you're goin'?","Where everybody here, they know my game","Where is home, I want you to know","Where we can both fall far in love","Where were you?","While I'm watch, watch, watching people pass","Who are you gonna follow?","Who don't know, where to go.","Who said it's true,","Who somehow could see the good part of me","Whoa... whoa...","Why can't you take my hand","Why do we gotta tell each other how to live?","Why won't you hold my hand","Why won't you take my hand","Why you so speechless, so speechless?","Will I ever be more than I've always been?","Will I ever make a sound?","Will I just keep on running away from what's true?","Will you ever talk again?","Wish that I'd known this feeling was coming","With a language that I understand","With all your subtext and fantasy","With blonde hair and a gun smoking under her toes","With love in the world","With me tonight.","With the same old song in my same old heart","With you I'd watch them all be burnt","With you dirty mouth","With your","With your James Dean glossy eyes","With your Johnnie Walker eyes","With your dirty mouth","With your half wired broken jaw","With your honest","Without you, I'll never be home","Won't even sing along","Won't go without my fix tonight","Won't poke holes in the seats with my heels","Wondering how the world might look from up so high","Words fail, words fail","Work your blonde JonBenét Ramsey","Would they like what they saw?","Would you give it all up?","Wouldn't say goodbye","Wouldn't that be cool?","Wow","Wrecked all my innocence","Write a book or learn to sail","Yeah I'll love you forever","Yeah I'm gonna make it happen this time","Yeah he'd a never last","Yeah it always brings me down","Yeah something about, baby, you and I.'\"","Yeah, I am red, you are blue.","Yeah, I guess, I could forgive you, tonight.","Yeah, at least now I know","Yeah, it always brings me down","Yeah, when you say stop,","Yeah, you can see clearly, that I am the one you want.","Yeah, you'd be it","Yeah.","Yes it's rough","You","You always bring me down ","You always said that I'd come back to you again","You always thought it was me.","You and I","You better get here soon","You better than, you better than","You came out of nowhere","You can change right next to me","You can ebb and I can flow","You can put me down","You can walk a mile in 'em, tell me how they feel on you","You can't flood this town","You can't have my heart","You can't stop me","You can't stop my voice cause","You cant deny me my astronomy","You do something for me","You don't ever have to leave","You don't have to hide your love away and","You don't own my life but","You fooled me again","You gave me the world that I wanted","You got a lock on the things I want","You got ripped jeans.","You got your cigarette.","You have all these choices, I have none","You hear my gun ring, oh.","You holy fool","You just had a salad today, Boulangerie","You know I appreciate the finer things","You know I need you so desperately","You know I'm tellin', I'm tellin' you...","You know I'm tellin', I'm tellin' you...oh..","You know how bad I can get,","You know that I'd never cheat on a man.","You left me speechless, so speechless","You make me an honest man","You make me feel like I'm floatin' off the ground","You may not think I know the difference","You need to go and find yourself","You ought to pity me cause there's always one man to love","You popped my heart seams","You put all your faith in my dreams","You said that you knew","You say it's safer on your own","You say there's so much you don't know","You say you'd rather be alone","You see, I don't know what to tell you now","You taste like whiskey when you kiss me, oh","You threw your hands up","You were a perfect illusion","You were acting kind of strange","You were so perfect","You will never fall apart","You won't be the only one","You won't believe that you're ready","You won't forget me, when I'm gone.","You won't let go of your layers","You'd rather sleep alone","You'll never have to wait your turn.","You'll ruin the good ones","You're afraid to need someone","You're all that I have to lose","You're just like the wind 'cause","You're my babe, right through.","You're my kind of man.","You're never ever ever gonna stop","You're never ever ever gonna stop me now","You're never ever gonna stop me now","You're so afraid of tomorrow","You're so honest","You're spades & I'm diamonds,","You've got brown eyes","You've got me wondering why I","You've gotta a lot of lot of nerve","You've gotta hold your own","You've gotta hold your own ","You've left me speechless, so speechless","You, you and I","You, you and I, I, I","You, you, you and I","Young, wild, American","Your fire's lit and so is mine","Your hands are mine","Your love is nothing I can't fight","Your mind, your deck, you're hidden.","Your tender loving's more than I can handle","Youre so full of it","[Verse 1]","and body plastic","and liquor bottles","at least your honest","cigarette to be over, you know","famous","fortune","full of thoes rust out New York lies","hot blondes in odd positions","like to shoot you decide","material","na na nana na na nanananana","opposed to the typical","picture in the city lights","you're so freakin honest","you're so full of it","‘Cause the showbiz, all the caviar","‘Cause your songs are on the radio","‘Cause your songs are on the radio "]